{
    "current": [
        {
            "title": "Dynamic Projected Cash Flow Analysis",
            "summary": "This project implements a complex class to analyze and project cash flows using historical data stored in a SQLite database, providing dynamic insights into cash management.",
            "link": "project-template.html",
            "date": "2024-09-05"
        },
        {
            "title": "Analysis and Optimization of an Investment Portfolio Using Machine Learning Models",
            "summary": "This project focuses on building a model capable of analyzing historical financial asset data and optimizing an investment portfolio using advanced techniques, including Efficient Frontier and Sharpe Ratio calculations.",
            "link": "project_2.html",
            "date": "2024-08-20"
        },
        {
            "title": "Investment Portfolio Optimization with Machine Learning and PCA",
            "summary": "This model emphasizes the use of advanced Machine Learning techniques, such as Random Forest and XGBoost, along with dimensionality reduction using PCA to enhance portfolio optimization.",
            "link": "project_3.html",
            "date": "2024-07-08"
        },
        {
            "title": "Detailed Academic Exercise on Portfolio Analysis Using Financial Models",
            "summary": "This project includes all steps, explanations, and formulas used throughout the process, providing a comprehensive academic approach to portfolio analysis and optimization.",
            "link": "project_4.html",
            "date": "2024-07-30"
        },
        {
            "title": "AI-Based Financial Alert System for Identifying Investment Opportunities",
            "summary": "Project aims to develop an advanced tool that leverages artificial intelligence and data analysis to alert investors of potential opportunities in the financial market. By combining machine learning techniques, natural language processing (NLP), and time series analysis",
            "link": "project_5.html",
            "date": "2024-05-10"
        }
    ],
    "archived": [
        {
            "title": "Proposal for Managing a Dashboard with Power BI",
            "summary": "This proposal presents an interactive dashboard designed in Power BI, focused on financial management and analysis. It includes key performance indicators such as revenue, expenses, profits, and margins, accompanied by detailed charts and tables that visualize performance by department, segment, and product. With interactive filters, users can customize the view for deeper analysis and make informed decisions. The intuitive and professional design is tailored to enhance user experience and maximize efficiency in strategic decision-making.",
            "link": "project_5.html",
            "date": "2023-12-15"
        },
        {
            "title": "Archived Investment Strategy Analysis",
            "summary": "A review of past investment strategies, focusing on their effectiveness and areas of improvement based on historical performance data.",
            "link": "#",
            "date": "2023-11-10"
        },
        {
            "title": "Archived Machine Learning Portfolio Optimization",
            "summary": "Explores the use of Machine Learning models to optimize portfolios, comparing outcomes with traditional financial metrics.",
            "link": "#",
            "date": "2023-10-05"
        },
        {
            "title": "Archived Article on Financial Modeling Techniques",
            "summary": "An overview of financial modeling techniques applied to investment portfolios, emphasizing risk and return optimization.",
            "link": "#",
            "date": "2023-09-01"
        },
        {
            "title": "Archived Insights on Market Analysis",
            "summary": "Archived article providing insights into market trends and analysis, highlighting significant findings from past studies.",
            "link": "#",
            "date": "2023-08-25"
        }
    ]
}
