{
    "current": [
        {
            "title": "Current Article 1",
            "summary": "El mercado de trabajo no está siendo capaz de mantener el ritmo de la revolución digital, así lo aseguran consultoras estratégicas como McKinsey & Company. Como consecuencia, en los próximos años nos encontraremos —de hecho, ya ocurre— con un déficit profesional para cubrir determinados puestos de trabajo que requieren de individuos con capacidades tecnológicas especializadas.
                        Sorprendidas por la Cuarta Revolución Industrial, las compañías han experimentado grandes cambios internos en los últimos años, renovando su cultura empresarial, digitalizándose y promoviendo la creatividad y la innovación entre sus empleados. Estos últimos, por su parte, se han visto obligados a abrazar el aprendizaje continuo (lifelong learning) para no quedarse descolgados del mercado laboral. Y es que la revolución digital impone una marcha demasiado exigente, creando continuamente nuevas profesiones y roles para los que faltan trabajadores con la formación adecuada.",
            "link": "#",
            "date": "2024-09-05"
        },
        {
            "title": "Current Article 2",
            "summary": "Summary of the current article 2.",
            "link": "#",
            "date": "2024-08-20"
        },
        {
            "title": "Current Article 3",
            "summary": "Summary of the current article 3.",
            "link": "#",
            "date": "2024-08-15"
        },
        {
            "title": "Current Article 4",
            "summary": "Summary of the current article 4.",
            "link": "#",
            "date": "2024-07-30"
        },
        {
            "title": "Current Article 5",
            "summary": "Summary of the current article 5.",
            "link": "#",
            "date": "2024-07-10"
        }
    ],
    "archived": [
        {
            "title": "Archived Article 17",
            "summary": "Summary of an older article that is now archived.",
            "link": "#",
            "date": "2023-12-15"
        },
        {
            "title": "Archived Article 18",
            "summary": "Summary of another older article that is now archived.",
            "link": "#",
            "date": "2023-11-10"
        },
        {
            "title": "Archived Article 19",
            "summary": "Summary of another archived article.",
            "link": "#",
            "date": "2023-10-05"
        },
        {
            "title": "Archived Article 20",
            "summary": "Summary of a previous archived article.",
            "link": "#",
            "date": "2023-09-01"
        },
        {
            "title": "Archived Article 21",
            "summary": "Summary of another archived article that was published earlier.",
            "link": "#",
            "date": "2023-08-25"
        }
    ]
}

